Расширения/Распределение задач/InformationRegisters/Расш1_Дев_НастройкиРаспределенияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_Дев_НастройкиРаспределенияЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяПринятияЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакреплятьОтвественного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокЗакрепления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьЗанятость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширения/Распределение задач/InformationRegisters/Расш1_Дев_НастройкиРаспределенияЗадач/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТипов = УПДК_БизнесПроцессыИЗадачи.ТипыСогласуемыхДокументов();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", МассивТипов));
	Элементы.ТипДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	НеДоступноДляРедактирования(, Запись);
	
	Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи) Тогда 
		Запись.Используется = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПринятияЗадачиПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры 

&НаКлиенте
Процедура ЗакреплятьОтвественногоПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаКлиенте
Процедура СрокЗакрепленияПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаСервере
Процедура НеДоступноДляРедактирования(Имя = Неопределено, Знач Запись)
	
	ДоступностьГруппыЗакрепления = Запись.ЗакреплятьОтвественного Или Запись.СрокЗакрепления > 0 Или ЗначениеЗаполнено(Запись.ИдентификаторОбъекта);
	
	Если Имя = Неопределено Тогда
		Если Запись.ВремяПринятияЗадачи > 0 Тогда
			Элементы.ГруппаЗакрепленияОтвестсвенного.Доступность = Ложь;
		ИначеЕсли ДоступностьГруппыЗакрепления Тогда
			Элементы.ВремяПринятияЗадачи.Доступность = Ложь;
			Элементы.УчитыватьЗанятость.Доступность = Ложь;
		КонецЕсли; 
	Иначе
		Если Имя = "ВремяПринятияЗадачи" Тогда
			Элементы.ГруппаЗакрепленияОтвестсвенного.Доступность = Не Запись.ВремяПринятияЗадачи > 0;
		КонецЕсли;
		
		Если Имя = "ЗакреплятьОтвественного" Или
			Имя = "СрокЗакрепления" Или 
			Имя = "ТипДокумента" Тогда
			Элементы.ВремяПринятияЗадачи.Доступность = Не ДоступностьГруппыЗакрепления;
			Элементы.УчитыватьЗанятость.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УчитыватьЗанятостьПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись);
КонецПроцедуры
